app/views/photos/_form.html.erb

SELECT "categories".* FROM "categories"
---
          <%= f.label :category %>
          <%= f.select :category_id, Category.all.collect {|category| [category.name, category.id] }, {:include_blank => 'Select one'}, class:'form-control' %>