app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "this is a test"], ["created_at", "2015-12-30 03:57:13.243138"], ["updated_at", "2015-12-30 03:57:13.243138"]]