app/controllers/photos_controller.rb

INSERT INTO "photos" ("title", "photo", "description", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @photo = Photo.new(photo_params)
    @photo.user_id = current_user.id
    if @photo.save

DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 32]]
---
  def destroy
    if current_user.id == @photo.user_id
      @photo.destroy

SELECT  "photos".* FROM "photos" LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "photos"
SELECT "categories".* FROM "categories"
---
  def index
    @photos = Photo.all.page(params[:page]).per(6)
    @categories = Category.all

UPDATE "photos" SET "photo" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["photo", "pexels-photo.jpg"], ["updated_at", "2015-12-31 22:06:56.463625"], ["id", 32]]
---
  def update
    if current_user.id == @photo.user_id
      if @photo.update(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 32]]
---
  def set_photos
    @photo = Photo.find(params[:id])