app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    #prevents a user to create another acct while logged in
    if current_user
      redirect_to user_path(current_user)
    else
      @user = User.new(user_params)
      if @user.save