app/controllers/welcome_controller.rb

SELECT  "photos".* FROM "photos"  ORDER BY "photos"."id" ASC LIMIT 6
---
  def home_page
    @photos = Photo.first(6)